fio/log/f2fs_3rd_random_write_log.txt
fio_test: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.2.8
Starting 8 threads

fio_test: (groupid=0, jobs=1): err= 0: pid=2776: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26216KB/s, iops=6554, runt=31997724msec
    slat (usec): min=1, max=33717, avg= 6.43, stdev= 6.07
    clat (msec): min=1, max=119, avg=19.52, stdev=14.90
     lat (msec): min=1, max=119, avg=19.53, stdev=14.90
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54528], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min= 9088, max=120648, per=12.52%, avg=26240.54, stdev=7000.64
    lat (msec) : 2=0.01%, 4=1.94%, 10=13.80%, 20=58.75%, 50=23.49%
    lat (msec) : 100=2.02%, 250=0.01%
  cpu          : usr=0.93%, sys=5.21%, ctx=57199200, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2777: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26210KB/s, iops=6552, runt=32005750msec
    slat (usec): min=1, max=32077, avg= 6.42, stdev= 6.07
    clat (msec): min=1, max=120, avg=19.53, stdev=14.91
     lat (msec): min=1, max=120, avg=19.53, stdev=14.91
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54016], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min= 9117, max=119688, per=12.51%, avg=26234.08, stdev=7080.80
    lat (msec) : 2=0.01%, 4=1.98%, 10=13.79%, 20=58.67%, 50=23.53%
    lat (msec) : 100=2.02%, 250=0.01%
  cpu          : usr=0.94%, sys=5.19%, ctx=57190914, majf=0, minf=2
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2778: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26209KB/s, iops=6552, runt=32007152msec
    slat (usec): min=1, max=32476, avg= 6.45, stdev= 6.00
    clat (usec): min=588, max=112043, avg=19528.48, stdev=14911.41
     lat (usec): min=591, max=112051, avg=19534.99, stdev=14911.49
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54528], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[83456]
    bw (KB  /s): min=10343, max=119608, per=12.51%, avg=26232.49, stdev=7042.11
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.96%, 10=13.82%, 20=58.68%, 50=23.50%
    lat (msec) : 100=2.03%, 250=0.01%
  cpu          : usr=0.93%, sys=5.22%, ctx=57157078, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2779: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26221KB/s, iops=6555, runt=31992536msec
    slat (usec): min=1, max=34064, avg= 6.43, stdev= 6.06
    clat (usec): min=952, max=119539, avg=19519.57, stdev=14902.85
     lat (usec): min=961, max=119542, avg=19526.07, stdev=14902.92
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54016], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min=11000, max=121656, per=12.52%, avg=26245.07, stdev=7033.88
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.96%, 10=13.79%, 20=58.74%, 50=23.48%
    lat (msec) : 100=2.02%, 250=0.01%
  cpu          : usr=0.93%, sys=5.21%, ctx=57186515, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2780: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26207KB/s, iops=6551, runt=32008706msec
    slat (usec): min=1, max=33700, avg= 6.43, stdev= 6.07
    clat (usec): min=379, max=115264, avg=19529.46, stdev=14916.23
     lat (usec): min=383, max=115274, avg=19535.95, stdev=14916.30
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54528], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min=10282, max=171416, per=12.51%, avg=26230.69, stdev=7105.43
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.97%, 10=13.81%, 20=58.66%, 50=23.52%
    lat (msec) : 100=2.03%, 250=0.01%
  cpu          : usr=0.93%, sys=5.20%, ctx=57178318, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2781: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26218KB/s, iops=6554, runt=31995752msec
    slat (usec): min=1, max=33719, avg= 6.43, stdev= 6.03
    clat (msec): min=1, max=120, avg=19.52, stdev=14.91
     lat (msec): min=1, max=120, avg=19.53, stdev=14.91
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54528], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min=10295, max=122112, per=12.52%, avg=26242.44, stdev=7085.76
    lat (msec) : 2=0.01%, 4=1.98%, 10=13.79%, 20=58.71%, 50=23.49%
    lat (msec) : 100=2.03%, 250=0.01%
  cpu          : usr=0.92%, sys=5.21%, ctx=57163679, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2782: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26211KB/s, iops=6552, runt=32004032msec
    slat (usec): min=1, max=32101, avg= 6.43, stdev= 5.97
    clat (msec): min=1, max=114, avg=19.53, stdev=14.91
     lat (msec): min=1, max=114, avg=19.53, stdev=14.91
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54528], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min= 8710, max=120520, per=12.51%, avg=26235.66, stdev=7022.01
    lat (msec) : 2=0.01%, 4=1.95%, 10=13.81%, 20=58.70%, 50=23.51%
    lat (msec) : 100=2.02%, 250=0.01%
  cpu          : usr=0.92%, sys=5.21%, ctx=57168679, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=2783: Sat Jan 21 03:51:58 2017
  write: io=819200MB, bw=26211KB/s, iops=6552, runt=32004579msec
    slat (usec): min=1, max=32045, avg= 6.43, stdev= 6.04
    clat (msec): min=1, max=111, avg=19.53, stdev=14.91
     lat (msec): min=1, max=111, avg=19.53, stdev=14.91
    clat percentiles (usec):
     |  1.00th=[ 2832],  5.00th=[ 8160], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10560], 40.00th=[11072], 50.00th=[11712], 60.00th=[12608],
     | 70.00th=[15296], 80.00th=[41216], 90.00th=[45824], 95.00th=[47872],
     | 99.00th=[54528], 99.50th=[63232], 99.90th=[70144], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min=10600, max=116270, per=12.51%, avg=26235.10, stdev=7059.30
    lat (msec) : 2=0.01%, 4=1.97%, 10=13.82%, 20=58.67%, 50=23.50%
    lat (msec) : 100=2.03%, 250=0.01%
  cpu          : usr=0.93%, sys=5.20%, ctx=57223441, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=6400.0GB, aggrb=209658KB/s, minb=26207KB/s, maxb=26220KB/s, mint=31992536msec, maxt=32008706msec

Disk stats (read/write):
  nvme0n1: ios=0/1677716694, merge=0/0, ticks=0/2640482588, in_queue=3914103886, util=100.00%