fio/log/f2fs_4th_sequential_write_log.txt
fio_test: (g=0): rw=write, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.8
Starting 1 thread

fio_test: (groupid=0, jobs=1): err= 0: pid=4415: Sat Jan 21 04:41:14 2017
  write: io=819200MB, bw=283770KB/s, iops=2216, runt=2956131msec
    slat (usec): min=6, max=938, avg=17.38, stdev= 9.12
    clat (msec): min=1, max=207, avg=57.72, stdev=20.10
     lat (msec): min=1, max=207, avg=57.73, stdev=20.10
    clat percentiles (msec):
     |  1.00th=[   22],  5.00th=[   29], 10.00th=[   33], 20.00th=[   38],
     | 30.00th=[   44], 40.00th=[   51], 50.00th=[   58], 60.00th=[   64],
     | 70.00th=[   71], 80.00th=[   78], 90.00th=[   84], 95.00th=[   86],
     | 99.00th=[  103], 99.50th=[  116], 99.90th=[  147], 99.95th=[  157],
     | 99.99th=[  172]
    bw (KB  /s): min=145117, max=702976, per=100.00%, avg=283919.31, stdev=98638.96
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.17%, 20=0.69%, 50=37.99%
    lat (msec) : 100=59.73%, 250=1.42%
  cpu          : usr=2.18%, sys=4.24%, ctx=5249772, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=6553600/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=819200MB, aggrb=283769KB/s, minb=283769KB/s, maxb=283769KB/s, mint=2956131msec, maxt=2956131msec

Disk stats (read/write):
  nvme0n1: ios=0/6552426, merge=0/0, ticks=0/377970860, in_queue=18446744069793419095, util=100.00%